public class Main {
    public static void main(String[] args) {

        Container container = new Container();
        container.addCount(5672);
        System.out.println(container.getCount());


        // TODO: ниже напишите код для выполнения задания:
        //  С помощью цикла и преобразования чисел в символы найдите все коды
        //  букв русского алфавита — заглавных и строчных, в том числе буквы Ё.

        int amount = 0;

        for (int i = 0; amount < 66; i++) {
            char c = (char) i;
            if (c == 'А'|| c == 'а'|| c =='Б'|| c =='б'|| c =='В'|| c =='в'|| c =='Г'||
                    c == 'г'|| c == 'Е'|| c == 'е'|| c == 'Ё'|| c == 'ё'|| c == 'Ж'|| c == 'ж'||
                    c == 'З'|| c == 'з'|| c == 'И'|| c == 'и'|| c == 'Й'|| c == 'й'|| c == 'К'||
                    c == 'к'|| c == 'Л'|| c == 'л'|| c == 'М'|| c == 'м'|| c == 'Н'|| c == 'н'||
                    c == 'О'|| c == 'о'|| c == 'П'|| c == 'п'|| c == 'Р'|| c == 'р'|| c == 'С'||
                    c == 'с'|| c == 'Т'|| c == 'т'|| c == 'У'|| c == 'у'|| c == 'Ф'|| c == 'ф'||
                    c == 'Х'|| c == 'х'|| c == 'Ц'|| c == 'ц'|| c == 'Ч'|| c == 'ч'|| c == 'Ш'||
                    c == 'ш'|| c == 'Щ'|| c == 'щ'|| c == 'Ъ'|| c == 'ъ'|| c == 'Ы'|| c == 'ы'||
                    c == 'Ь'|| c == 'ь'|| c == 'Э'|| c == 'э'|| c == 'Ю'|| c == 'ю'|| c == 'Я'||
                    c == 'я'||c == 'Д'|| c == 'д') {
                amount = amount + 1;
                System.out.println(i + " - " + c);
            }
        }
    }
}
